/***********************************************
文件名  :    reverse_str.c
功能    :    实现字符串中单词的反向输出
函数列表:    reverse_str
***********************************************/

#include <stdio.h>

/***********************************************
函数    :    reverse_str
功能    :    实现字符串中单词的反向输出
传入参数:    *source  :  传入的源字符串
传出参数:    无
返回值  :    无
***********************************************/
int reverse_str(char *source)
{
    char dest[100][100];           /*定义二维数组用来存放字符传中的单词*/
    int i = 0;
    int line = 0;                  /*定义数组中的行*/
    int row  = 0;                  /*定义数组中的列*/  
    
    while (*source != '\0')         
    {
        if (*source == ' ')         /*空格代表单词的结束符号*/
	{
	    dest[line][row] = ' ';  /*在每个单词后面加上空格*/
	    source++;                
	    row++;                  /*用来存放下一个单词*/ 
	    dest[line][row] = '\0'; /*给每一个单词后面加上字符串结束符号*/
	    line++;
	    row = 0;
	}
        else
	{    
	    dest[line][row] = *source;  /*如果没有遇到单词结束符号则把字符串中的字符给二维数组*/
	    row++;
	    source++;
        }
    }

    dest[line][row] = ' ';

    for (i = line; i >= 0; i--)     /*循环打印转换后的单词*/
    {
        printf("%s",dest[i]); 
    }

    printf("\n");
}
