/**************************************************************
文件名   :    change_num.c
功能     :    将传入参数的每一位变位它相邻两位的与或的结果然后输出
函数列表 :    changge_num
**************************************************************/

#include <stdio.h>
/*************************************************************
函数    :    change_num
功能    :    将传入的参数的每一位变成与它相邻的两位与或的结果然后打印输出
传入参数:    input_num : 传入需要被修改的的参数
传出参数:    无
返回值  :    无
*************************************************************/
void change_num(unsigned int input_num)
{
    int store_bit[32];                      /*定义一个数组用来存放传入参数的每一位*/
    int i = 0;
    int new_store_bit[32];
    int mask = 0x1;                         /*定义掩码用来取出传入参数的每一位*/


    for (i = 0; i < 32; i++)                /*循环取出传入参数的每一位*/
    {
        store_bit[i] = input_num & mask;    /*用来存放取出参数中的位*/
	input_num = input_num >> 1;         /*让参数右移一位*/
    }

    for (i = 1; i < 31; i++)                /*循环传入参数中的每一位进行与或运算*/
    {
        new_store_bit[i] = (store_bit[i-1] ^ store_bit[i+1]);
    }

    new_store_bit[0] = (store_bit[1] ^ store_bit[31]);    /*对边界第一位进行特殊处理*/
    new_store_bit[31] = (store_bit[30] ^ store_bit[0]);   /*对边界最后一位进行特殊处理*/

    for (i = 31; i >= 0 ; i--)                        /*循环打印出经过转换的传入参数*/ 
    {
        printf("%d",new_store_bit[i]);
    }

    printf("\n");
}
