/************************************************************
文件名  :    set_bit.c
功能    :    实现将传入的参数的目标位修改为指定数值
************************************************************/

#include <stdio.h>

/*************************************************************
函数    :    set_bit
功能    :    将函数中的中间的某位设置成传入值
传入参数:    middle_bit :需要修改的目标位
             bit_num    :修改成的目标值
	         input_num  :需要修该的目标
传出参数:  
返回值  :    无    
*************************************************************/

int set_bit(int middle_bit, int bit_num, int input_num)
{
    int temp_bit = 0;                         /*定义临时变量用来存取取出的目标的位*/
    int store_bit[32];                        /*定义一个数组用来存放目标数的每一位*/
    int mask = 0x1;                           /*掩码用来取目标值的位的值*/
    int i = 0;

    for (i = 0; i < 32; i++)                  /*循环取出目标值的每一位*/
    {
        store_bit[i] = input_num & mask;      /*取出目标值的单个位*/
	input_num = input_num >> 1;           /*目标值右移一位*/
    }

    store_bit[middle_bit] = bit_num;          /*修改目标为的值*/  

    i = 0;

    for (i = 0; i < 32; i++)                  /*循环打印修改后的目标值的每一位*/
    {
        printf("%d",store_bit[i]);
    }


}
