/***************************************************
文件名  :    stratum.c
功能    :    实现n的阶层
函数列表:    strtum : 实现求n 的阶层
修改日期:    2011-02-19 
***************************************************/

#include <stdio.h>

/**************************************************
函数    :     stratum.c
功能    :     实现求n的阶层
传入参数:     input_num : 要求的阶层数
传出参数:     无
返回值  :     0    :传入参数有误
              1    :特殊情况0或者1的阶层
              total:传入参数的阶层
修改日期:     2011 - 02 - 19	      
***************************************************/
int stratum(int input_num)
{
    if (input_num < 0)                            /*传入参数有误进行出错处理*/
    {
        printf("传入参数有误");                      
        return 0;
    }

    if (input_num == 0 || input_num == 1)       /*对特殊情况进行处理*/
    {
        return 1;
    }

    return input_num * stratum(input_num - 1);   /*求传入参数的阶层*/
}
